In [246]:
import pandas as pd
import numpy as py

Loading dataset in pandas

In [247]:
df= pd.read_csv(r"C:\Users\Asus\Downloads\Titanic-Dataset.csv")

In [248]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

###Viewing the dataset

In [249]:
df.head(5)
df.tail(5)
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [250]:
df[["PassengerId","Sex","Name"]].head(5)

   PassengerId     Sex                                               Name
0            1    male                            Braund, Mr. Owen Harris
1            2  female  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3  female                             Heikkinen, Miss. Laina
3            4  female       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5    male                           Allen, Mr. William Henry

In [251]:
###loc -passengerid sex name and 0 ,1,
#iloc- 0,1,2-01,2,

In [252]:
###slicing in pandas using (loc and iloc)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [253]:
df.loc[10:20,"Ticket":"Embarked"]

       Ticket     Fare Cabin Embarked
10    PP 9549  16.7000    G6        S
11     113783  26.5500  C103        S
12  A/5. 2151   8.0500   NaN        S
13     347082  31.2750   NaN        S
14     350406   7.8542   NaN        S
15     248706  16.0000   NaN        S
16     382652  29.1250   NaN        Q
17     244373  13.0000   NaN        S
18     345763  18.0000   NaN        S
19       2649   7.2250   NaN        C
20     239865  26.0000   NaN        S

In [254]:
df.iloc[10:20,8:]

       Ticket     Fare Cabin Embarked
10    PP 9549  16.7000    G6        S
11     113783  26.5500  C103        S
12  A/5. 2151   8.0500   NaN        S
13     347082  31.2750   NaN        S
14     350406   7.8542   NaN        S
15     248706  16.0000   NaN        S
16     382652  29.1250   NaN        Q
17     244373  13.0000   NaN        S
18     345763  18.0000   NaN        S
19       2649   7.2250   NaN        C

### Getting information about the data

In [255]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
786,787,1,3,"Sjoblom, Miss. Anna Sofia",female,18.0,0,0,3101265,7.4958,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
843,844,0,3,"Lemberopolous, Mr. Peter L",male,34.5,0,0,2683,6.4375,NaN,C
291,292,1,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0,1,0,11967,91.0792,B49,C
108,109,0,3,"Rekic, Mr. Tido",male,38.0,0,0,349249,7.8958,NaN,S

In [256]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Checking missing value

In [257]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [258]:
df["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [259]:
agemean=df["Age"].mean().round(2)
df["Age"].fillna(agemean,inplace=True)
agemean

np.float64(29.7)

In [260]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [261]:
embarked_mode=df["Embarked"].mode()[0]
df["Embarked"].fillna(embarked_mode)   
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [262]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [263]:
removing_columns=["PassengerId","Name","Ticket"]

In [264]:
df=df  .drop(removing_columns,axis=1)

In [265]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [266]:
df["FamilySize"]=df["SibSp"]+df["Parch"]+1

In [267]:
df=df.drop(columns=["SibSp","Parch"])

In [268]:
df.head()

   Survived  Pclass     Sex   Age     Fare Cabin Embarked  FamilySize
0         0       3    male  22.0   7.2500   NaN        S           2
1         1       1  female  38.0  71.2833   C85        C           2
2         1       3  female  26.0   7.9250   NaN        S           1
3         1       1  female  35.0  53.1000  C123        S           2
4         0       3    male  35.0   8.0500   NaN        S           1

In [269]:
#df=df.drop(columns=["Cabin"])

In [270]:
df.head()

   Survived  Pclass     Sex   Age     Fare Cabin Embarked  FamilySize
0         0       3    male  22.0   7.2500   NaN        S           2
1         1       1  female  38.0  71.2833   C85        C           2
2         1       3  female  26.0   7.9250   NaN        S           1
3         1       1  female  35.0  53.1000  C123        S           2
4         0       3    male  35.0   8.0500   NaN        S           1

In [271]:
    ### Convert categorical variables to numerical

In [272]:
df["Gender"]=df["Sex"].map({"male":0,"female":1})
df=df.drop(columns=["Sex"])

In [273]:
df.head()

   Survived  Pclass   Age     Fare Cabin Embarked  FamilySize  Gender
0         0       3  22.0   7.2500   NaN        S           2       0
1         1       1  38.0  71.2833   C85        C           2       1
2         1       3  26.0   7.9250   NaN        S           1       1
3         1       1  35.0  53.1000  C123        S           2       1
4         0       3  35.0   8.0500   NaN        S           1       0

In [274]:
df1=df.copy()

In [275]:
df1.head()

   Survived  Pclass   Age     Fare Cabin Embarked  FamilySize  Gender
0         0       3  22.0   7.2500   NaN        S           2       0
1         1       1  38.0  71.2833   C85        C           2       1
2         1       3  26.0   7.9250   NaN        S           1       1
3         1       1  35.0  53.1000  C123        S           2       1
4         0       3  35.0   8.0500   NaN        S           1       0

In [276]:
df1=pd.get_dummies(df1,columns=["Embarked"],dtype=int,drop_first=True)

In [277]:
df1.head()

,Survived,Pclass,Age,Fare,Cabin,FamilySize,Gender,Embarked_Q,Embarked_S
0,0,3,22.0,7.2500,NaN,2,0,0,1
1,1,1,38.0,71.2833,C85,2,1,0,0
2,1,3,26.0,7.9250,NaN,1,1,0,1
3,1,1,35.0,53.1000,C123,2,1,0,1
4,0,3,35.0,8.0500,NaN,1,0,0,1

In [278]:
def fare_category(fare):
    if fare<15:
        return "Low"
    elif fare<40:
        return "Medium"
    else:
        return "High"

In [279]:
df1["Fare_category"]=df["Fare"].apply(fare_category)

In [280]:
df1.head()

,Survived,Pclass,Age,Fare,Cabin,FamilySize,Gender,Embarked_Q,Embarked_S,Fare_category
0,0,3,22.0,7.2500,NaN,2,0,0,1,Low
1,1,1,38.0,71.2833,C85,2,1,0,0,High
2,1,3,26.0,7.9250,NaN,1,1,0,1,Low
3,1,1,35.0,53.1000,C123,2,1,0,1,High
4,0,3,35.0,8.0500,NaN,1,0,0,1,Low

In [281]:
df1["Has_Cabin"]= py.where(df1["Cabin"].notna(),"Yes","No")
df1["Has_Cabin"]=df1["Has_Cabin"].map({"Yes":1,"No":0})
df1["Fare_category"]=df1["Fare_category"].map({"High":1,"Low":0})

In [282]:
df1.drop(columns=["Cabin"],inplace=True)
df1.head()

,Survived,Pclass,Age,Fare,FamilySize,Gender,Embarked_Q,Embarked_S,Fare_category,Has_Cabin
0,0,3,22.0,7.2500,2,0,0,1,0.0,0
1,1,1,38.0,71.2833,2,1,0,0,1.0,1
2,1,3,26.0,7.9250,1,1,0,1,0.0,0
3,1,1,35.0,53.1000,2,1,0,1,1.0,1
4,0,3,35.0,8.0500,1,0,0,1,0.0,0

In [283]:

cleaned_df=df1.copy()
cleaned_df.head()

,Survived,Pclass,Age,Fare,FamilySize,Gender,Embarked_Q,Embarked_S,Fare_category,Has_Cabin
0,0,3,22.0,7.2500,2,0,0,1,0.0,0
1,1,1,38.0,71.2833,2,1,0,0,1.0,1
2,1,3,26.0,7.9250,1,1,0,1,0.0,0
3,1,1,35.0,53.1000,2,1,0,1,1.0,1
4,0,3,35.0,8.0500,1,0,0,1,0.0,0

In [285]:
cleaned_df.to_csv("cleaned_titanic_data.csv",index=False)